code/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

epsilonInlet  0.000003; // Cmu^0.75 * k^1.5 / L ; L =10

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform $epsilonInlet;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $epsilonInlet;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform $epsilonInlet;
        value           uniform $epsilonInlet;
    }

   topAndBottom
    {
        type            epsilonWallFunction;
        value           uniform $epsilonInlet;
    }
    
    
    cylinder
    {
        type            epsilonWallFunction;
        value           uniform $epsilonInlet;
    }

    frontAndBack
    {
        type            empty;
    }   
    

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
